<%
/* ============================================================================== */
/* =	PAGE : 결제 정보 환경 설정 PAGE													= */
/* =----------------------------------------------------------------------------= */
/* =	연동시 오류가 발생하는 경우 아래의 주소로 접속하셔서 확인하시기 바랍니다.							= */
/* =	접속 주소 : http://kcp.co.kr/technique.requestcode.do						= */
/* =----------------------------------------------------------------------------= */
/* =	Copyright (c)  2016  NHN KCP Inc.   All Rights Reserverd.				= */
/* ============================================================================== */

/* ============================================================================== */
/* =	개발/운영 구분 설정															= */
/* =----------------------------------------------------------------------------= */
/* =	KCP 정의값이 아닌 넥센타이어 자체 설정값												= */
/* =	PROD : 운영, DEV : 개발, LOCAL : 로컬										= */
/* ============================================================================== */
String sUrl = request.getRequestURL().toString();
sUrl = sUrl.toLowerCase();

String g_dev_mode = "PROD";

if(sUrl.indexOf("172.17.0.135") != -1 || sUrl.indexOf("1.254.67.135") != -1) {
	/* 개발 */
	g_dev_mode = "DEV";
} else if(sUrl.indexOf("localhost") != -1) {
	/* Local */
	g_dev_mode = "LOCAL";
}

/* ============================================================================== */
/* =	노출 텍스트 설정																= */
/* =----------------------------------------------------------------------------= */
/* =	KCP 정의값이 아닌 넥센타이어 자체 설정값												= */
/* ============================================================================== */
String g_ord_title = "NEXT LEVEL (TEST)";

if("PROD".equals(g_dev_mode)) {
	g_ord_title = "NEXT LEVEL";
}

/* ============================================================================== */
/* =	KCP 주문 페이지 설정															= */
/* =----------------------------------------------------------------------------= */
/* =	KCP 정의값이 아닌 넥센타이어 자체 설정값												= */
/* ============================================================================== */
String g_ord_page = "http://localhost/interface/kcp/sample/order_pay_ssl.jsp";

if("PROD".equals(g_dev_mode)) {
	g_ord_page = "https://portal.tirerental.co.kr/interface/kcp/sample/order_pay_ssl.jsp";
} else if ("DEV".equals(g_dev_mode)) {
	if(sUrl.indexOf("1.254.67.135") != -1) {
		g_ord_page = "http://1.254.67.135:9080/interface/kcp/sample/order_pay_ssl.jsp";
	} else if(sUrl.indexOf("172.17.0.135") != -1) {
		g_ord_page = "http://172.17.0.135:9080/interface/kcp/sample/order_pay_ssl.jsp";
	}
}

/* ============================================================================== */
/* =	KCP 취소 페이지 설정															= */
/* =----------------------------------------------------------------------------= */
/* =	KCP 정의값이 아닌 넥센타이어 자체 설정값												= */
/* ============================================================================== */
String g_cancel_page = "http://localhost/interface/kcp/sample/cancel.jsp";

if("PROD".equals(g_dev_mode)) {
	g_cancel_page = "https://portal.tirerental.co.kr/interface/kcp/sample/cancel.jsp";
} else if("DEV".equals(g_dev_mode)) {
	if(sUrl.indexOf("1.254.67.135") != -1) {
		g_cancel_page = "http://1.254.67.135:9080/interface/kcp/sample/cancel.jsp";
	} else if(sUrl.indexOf("172.17.0.135") != -1) {
		g_cancel_page = "http://172.17.0.135:9080/interface/kcp/sample/cancel.jsp";
	}
}

/* ============================================================================== */
/* =	영업관리시스템 DB 접속정보 설정													= */
/* =----------------------------------------------------------------------------= */
/* =	KCP 정의값이 아닌 넥센타이어 자체 설정값												= */
/* ============================================================================== */
String g_db_conn = "jdbc:oracle:thin:@172.17.0.135:1521:NXNEWBIZDEV";
String g_db_user = "NXRADMIN";
String g_db_pw	 = "rental~2015^*";

if("PROD".equals(g_dev_mode)) {
	g_db_conn = "jdbc:oracle:thin:@172.17.0.138:1521:NXNEWBIZ";
	g_db_pw	  = "admin_9_rental";
}

/* ============================================================================== */
/* =	주의																		= */
/* =	지불 데이터 설정																= */
/* =----------------------------------------------------------------------------= */
/* =	주의																		= */
/* =	g_conf_log_dir 변수 설정													= */
/* =	log 디렉토리 설정															= */
/* ============================================================================== */
String g_conf_log_dir = "C:\\logs\\kcp"; /* LOG 디렉토리 절대경로 입력 */

/* ============================================================================== */
/* =	주의																		= */
/* =	g_conf_gw_url 설정														= */
/* =----------------------------------------------------------------------------= */
/* =	테스트 시 : testpaygw.kcp.co.kr로 설정해 주십시오.									= */
/* =	실결제 시 : paygw.kcp.co.kr로 설정해 주십시오.										= */
/* ============================================================================== */
String g_conf_gw_url = "testpaygw.kcp.co.kr";

if("PROD".equals(g_dev_mode)) {
	g_conf_gw_url = "paygw.kcp.co.kr";
}

/* ============================================================================== */
/* =	주의																		= */
/* =	표준웹 결제창 g_conf_js_url 설정												= */
/* =----------------------------------------------------------------------------= */
/* =	테스트 시 : src="https://testpay.kcp.co.kr/plugin/payplus_web.jsp"			= */
/* =	실결제 시 : src="https://pay.kcp.co.kr/plugin/payplus_web.jsp"				= */
/* =----------------------------------------------------------------------------= */
/* =	플러그인 결제창 g_conf_js_url 설정												= */
/* =----------------------------------------------------------------------------= */
/* =	테스트 시 :	src="http://pay.kcp.co.kr/plugin/payplus_test.js"				= */
/* =			src="https://pay.kcp.co.kr/plugin/payplus_test.js"				= */
/* =	실결제 시 :	src="http://pay.kcp.co.kr/plugin/payplus.js"					= */
/* =			src="https://pay.kcp.co.kr/plugin/payplus.js"					= */
/* =	테스트 시(UTF-8) :	src="http://pay.kcp.co.kr/plugin/payplus_test_un.js"	= */
/* =					src="https://pay.kcp.co.kr/plugin/payplus_test_un.js"	= */
/* =	실결제 시(UTF-8) :	src="http://pay.kcp.co.kr/plugin/payplus_un.js"			= */
/* =					src="https://pay.kcp.co.kr/plugin/payplus_un.js"		= */
/* ============================================================================== */
String g_conf_js_url = "https://testpay.kcp.co.kr/plugin/payplus_web.jsp";

if("PROD".equals(g_dev_mode)) {
	g_conf_js_url = "https://pay.kcp.co.kr/plugin/payplus_web.jsp";
}

/* ============================================================================== */
/* =	스마트폰 SOAP 통신 설정														= */
/* =----------------------------------------------------------------------------= */
/* =	테스트 시 : false															= */
/* =	실결제 시 : true															= */
/* ============================================================================== */
boolean g_conf_server = false;

/* ============================================================================== */
/* =	g_conf_site_cd, g_conf_site_key 설정										= */
/* =	실결제시 KCP에서 발급한 사이트코드(site_cd), 사이트키(site_key)를 반드시					= */
/* =	변경해 주셔야 결제가 정상적으로 진행됩니다.											= */
/* =----------------------------------------------------------------------------= */
/* =	테스트 시 :	사이트코드(T0000)와 사이트키(3grptw1.zW0GSo4PQdaGvsF__)로				= */
/* =			설정해 주십시오.														= */
/* =	실결제 시 :	반드시 KCP에서 발급한 사이트코드(site_cd)와 사이트키(site_key)					= */
/* =			로 설정해 주십시오.													= */
/* ============================================================================== */
String g_conf_site_cd  = "T0000";
String g_conf_site_key = "3grptw1.zW0GSo4PQdaGvsF__";

if("PROD".equals(g_dev_mode)) {
	g_conf_site_cd	= "A8BQT";
	g_conf_site_key	= "2eBZvWOI9ISeNsLL0edD1jf__";
}

/* ============================================================================== */
/* =	g_conf_site_name 설정														= */
/* =----------------------------------------------------------------------------= */
/* =	사이트명 설정(한글 불가) : 반드시 영문자로 설정하여 주시기 바랍니다.							= */
/* ============================================================================== */
String g_conf_site_name = "KCP TEST SHOP";

if("PROD".equals(g_dev_mode)) {
	g_conf_site_name = "NEXT LEVEL";
}

/* ============================================================================== */
/* =	지불 데이터 셋업 (변경 불가)														= */
/* ============================================================================== */
String g_conf_log_level	= "3";
String g_conf_gw_port	= "8090";	/* 포트번호(변경불가)	*/
String module_type		= "01";		/* 변경불가		*/
int g_conf_tx_mode		= 0;		/* 변경불가		*/
%>